#1) შექმენით სია რომელშიც ჩამოწერეთ თქვენთვის სასურველ 15 დადებით რიცხვს, შემდეგ ამ სიას გადაუარეთ for ციკლით და if-ის საშვალებით შეამოწმეთ 
# თითოეული რიცხვი ლუწია თუ კენტი, დათვალეთ ლუწი რიცხვების რაოდენობა even ცვლადში რომელიც თავიდან იქნება 0, ხოლო ანალგოიურად დათვალეთ 
# კენტი რიცხვები odd ცვლადით. საბოლოოდ ტერმინალში გასაგებად გამოიტანეთ თუ რადენი ლუწი და რამდენი კენტი რიცხვია მოცემულ სიაში
numbers = [3, 8, 15, 22, 7, 14, 9, 6, 27, 10, 16, 18, 5, 2, 13]

even = 0
odd = 0

for num in numbers:
    if num % 2 == 0:
        even += 1
    else:
        odd += 1

print("Even numbers:", even)
print("Odd numbers:", odd)
     
