# 2) for ციკლის საშუალებით გამოიტანეთ რიცხვები 20-მდე
for i in range(1, 21):
    print(i, end=" ")
print("\n")

# 3) for ციკლის საშუალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით
for i in range(1, 31):
    print(i, end=" ")
print("\n")

# 4) for ციკლის საშუალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე
for i in range(15, 81):
    print(i, end=" ")
print("\n")

# 5) for ციკლის საშუალებით გამოიტანეთ რიცხვები 0-იდან 43-ჩათვლით
for i in range(0, 44):
    print(i, end=" ")
print("\n")

# 6) for ციკლის საშუალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ჩათვლით
for i in range(0, 51, 3):
    print(i, end=" ")
print("\n")

# 7) პროგრამას ჩადურად დაათვლევინეთ 50-ის ჩათვლით
sum_50 = sum(range(1, 51))
print("1-დან 50-მდე რიცხვების ჯამი:", sum_50, "\n")

# 8) პროგრამას გამოტანინეთ ყველა ლუწი რიცხვი 100-მდე
for i in range(0, 101, 2):
    print(i, end=" ")
print("\n")

# 9) პროგრამას გამოატანინეთ რიცხვები 20-იდან 0-მდე, for ციკლით
for i in range(20, -1, -1):
    print(i, end=" ")
print("\n")
