#2) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ ის ცვლადში და გაამრავლეთ ორზე, შემდეგ კი დაუბეჭდეთ წინადადება ფორმატით: 
#'Your number multiplied by 2 is <number>' სადაც <number>-ის ნაცვლად ჩაწერეთ 2-ზე გამრავლებულ რიცხვს, გამოიყენეთ ხელოვნური მონაცემტა 
#ტიპის შეცვლა, input-იდან მიღებული მნიშვნელობა გარდაქმენით ჯერ integer ტიპად შემდეგ კი string-ად. ახსენით კომენტარებით თუ როგორ შეასრულეთ
#დავალება
#3) მარტივი გამომთვლელი: შექმენით პროგრამა რომელიც მომხმარებელს შემოატაინინებს 2 რიცხვს და შეინახავს ცვლადებში, გარდაქმენით ეს რიცხვები 
#integer-ად, შემდეგ კი დაბეჭდეთ მათ შორის 4 მათემატიკური ოპერაცია (+,-,*,//)
#4) ჩამოწერეთ თქვენს მიერ შესწავლილი მონაცემტა ტიპის გარდამქმნელი ინსტრუქციები (str(), int(), float()) და ახსენით თუ რას აკეთებს თითოეული 
#მათგანი