#2
#Control flow პროგრამირების კონცეფციაში გულისხმობს იმ მეთოდებს, რომლითაც პროგრამა გადის სხვადასხვა ნაბიჯებით, ანუ რომელი ნაბიჯები 
#ან ბრძანებები შესრულდება შემდეგი ეტაპზე. ეს არის პროგრამის "მოძრაობის" მიმართულება, რომელსაც განსაზღვრავს გარკვეული ლოგიკური გადამისამართებები.
#Control flow-ის ძირითადი ტექნიკები:

#1. Sequential flow (თანმიმდევრული ნაკადი):
#ეს არის ყველაზე მარტივი კონტროლის ნაკადი, როდესაც პროგრამა ბოლო ბრძანებიდან მომდევნო ბრძანებამდე გადადის. ყოველი ბრძანება შესრულდება 
#ერთიანად, და ეს ხდება ზედიზედ.
a = 10
b = 20
print(a + b)  # აქ ხდება სემდე შესრულება

#2. Conditional flow (პერიოდული ნაკადი):
#როდესაც პროგრამა აკეთებს არჩევანს სხვადასხვა შესაძლო გზაებიდან (მაგალითად, if-else), ხდება ცვლის გადამისამართება გარკვეული პირობების მიხედვით.
a = 10
if a > 5:
    print("a არის დიდი 5-ს")
else:
    print("a არის მცირე ან ტოლი 5-ს")

#3. Looping flow (ბრუნვის ნაკადი):
#ეს ნაკადი შეიძლება იყოს ციკლი, რომელიც თავიდან დაიწყებს მოქმედებას, როცა შეასრულებს მოცემულ პირობას. ეს შეიძლება იყოს for ან while ციკლი.
for i in range(5):
    print(i)

#4. Jump flow (გადასვლის ნაკადი):
#გამოიყენება კონტროლის გადახვედრისთვის ერთ ადგილიდან მეორეში. ეს შეიძლება იყოს break, continue, return, goto (რომელიც ზოგიერთ ენაში არსებობს).
for i in range(10):
    if i == 5:
        break  # ციკლი შეწყდება, როდესაც i გახდება 5

