#2) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 0-იდან 20-მდე
#3) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 10-იდან 30-ის ჩათვლით
#4) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 15-იდან 80-მდე
#5) while ციკლის საშვალებით გამოიტანეთ რიცხვები 50-იდან 0-ჩათვლით
#6) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ის ჩათვლით
#7) while ციკლის საშვალებით გამოიტანეთ ლუწი რიცხვები 0-იდან 50-ის ჩათვლით
#8) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 100-იდან 20-ის ჩათვლით
#9) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება პაროლს სანამ ის არ შემოიყვანს goabest123-ს
#10) შექმენით პროგრამა while ციკლით რომელიც მომხარებელს შეეკითხება რიცხვებს სანამ ის არ შემოიყვანს რომელიმე რიცხვს 0-იდან 10-მდე
