#2) for ციკლის საშვალებით გამოიტანეთ ლუწი რიცხვები 20-იდან 40-მდე. შეასრულეთ იგივე while ციკლით
#3) შექმენით 1 ცვლადი, შემდეგ for ციკლის საშვალებით გაიგეთ ყველა რიცხვი 15-მდე და ყველა ეს რიცხვი დაამატეთ პირველად შექმნილ ცვლადში, 
#საბოლოოდ დაბეჭდეთ ჯამი. შეასრულეთ იგივე while ციკლით
#4) მომხმარებელს შემოატანინეთ 2 რიცხვი, შემდეგ კი ამ ორ რიცხვს შორის არსებული ყველა რიცხვის ჯამი გაიგეთ for ციკლის გამოყენებით უმციერსიდან 
#უდიდესამდე. საბოლოოდ დაბეჭდეთ ეს ჯამი
#5) შექმენით პაროლის ცვლადი და შეინახეთ თქვენთვის სასურველი სიტყვა, შემდეგ მომხმარებელს შეეკითხეთ პაროლი და შეინახეთ ცვლადში, იქამდე 
#შეეკითხეთ სანამ სწორად არ ჩაწერს while ციკლით გამოყენებით, საბოლოოდ კი დაუბეჭდეთ "Logged in successsfuly" ასევე ის თუ რამდენი ცდა დასჭირდა, 
#ამისთვის ცალკე ცვლადი შექმენით და ყოველ ციკლის გამეორებაზე გაზარდეთ 1-ით
