# 2) while ციკლით 0-დან 20-მდე რიცხვების დაბეჭდვა
i = 0
while i <= 20:
    print(i)
    i += 1

# 3) while ციკლით 10-დან 30-ის ჩათვლით რიცხვების დაბეჭდვა
i = 10
while i <= 30:
    print(i)
    i += 1

# 4) while ციკლით 15-დან 80-მდე რიცხვების დაბეჭდვა
i = 15
while i <= 80:
    print(i)
    i += 1

# 5) while ციკლით 50-დან 0-მდე უკუსვლით რიცხვების დაბეჭდვა
i = 50
while i >= 0:
    print(i)
    i -= 1

# 6) while ციკლით ყოველი მესამე რიცხვი 0-დან 50-მდე
i = 0
while i <= 50:
    print(i)
    i += 3

# 7) while ციკლით ლუწი რიცხვები 0-დან 50-მდე
i = 0
while i <= 50:
    print(i)
    i += 2

# 8) while ციკლით ყოველი მესამე რიცხვი 100-დან 20-მდე უკუსვლით
i = 100
while i >= 20:
    print(i)
    i -= 3

# 9) პროგრამა, რომელიც ითხოვს პაროლს მანამ, სანამ მომხმარებელი სწორად არ შეიყვანს
correct_password = "goabest123"
user_input = ""
while user_input != correct_password:
    user_input = input("შეიყვანეთ პაროლი: ")
print("წარმატებით შეხვდით სისტემაში!")

# 10) პროგრამა, რომელიც ითხოვს რიცხვებს, სანამ მომხმარებელი 0-დან 10-მდე რიცხვს არ შეიყვანს
while True:
    number = int(input("შეიყვანეთ რიცხვი: "))
    if 0 <= number <= 10:
        break
print("თქვენ შეიყვანეთ სწორი რიცხვი!")
