#2
# პროგრამა მომხმარებლის სახელს ითხოვს და ბეჭდავს შეტყობინებას
name = input("შეიყვანეთ თქვენი სახელი: ")
print(f"გამარჯობა, {name}!")

#3
# პროგრამა მომხმარებლისგან სახელს და ასაკს ითხოვს და ერთ print-ში ბეჭდავს
name = input("შეიყვანეთ თქვენი სახელი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")
print(f"გამარჯობა, {name}! თქვენ {age} წლის ხართ.")

#4
# and ოპერატორი შემოწმებას აკეთებს ორივე მნიშვნელობისთვის
print(True and False)   # False, რადგან ორივე True არ არის
print(False and True)   # False, რადგან ორივე True არ არის
print(True and True)    # True, რადგან ორივე True არის
print(False and False)  # False, რადგან ორივე False არის

#5
# or ოპერატორი აჩვენებს True, თუ რომელიმე operand-ის მნიშვნელობა True იქნება
print(True or False)   # True, რადგან ერთი True არის
print(False or True)   # True, რადგან ერთი True არის
print(True or True)    # True, რადგან ორივე True არის
print(False or False)  # False, რადგან ორივე False არის

#6
# 5 მაგალითი შედარების ოპერატორებით
print(5 == 5)  # True, რადგან 5 თანაბარია 5-ს
print(10 != 5) # True, რადგან 10 არ არის თანაბარი 5-ს
print(3 > 2)   # True, რადგან 3 დიდია 2-ზე
print(7 < 9)   # True, რადგან 7 პატარაა 9-ზე
print(8 >= 8)  # True, რადგან 8 დიდია ან თანაბარია 8-ს

#7
# მომხმარებელს ასაკი ვთხოვთ და შემოწმება ხდება, არის თუ არა 10-ის ტოლი
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
if age == 10:
    print("თქვენი ასაკი არის 10!")
else:
    print("თქვენი ასაკი არ არის 10.")
