#2) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და 
#დაპრინტავთ.
#3) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.
#4) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა 
#ტიპს ინახავს ცვლადი.
#5) აიღეთ 2 ცვლადი, რომლებშიც გექნებათ რიცხვითი integer ტიპის მნიშვნელობები, შემდეგ აიღეთ მესამე ცვლადი რომელშიც შეინახავთ უდიდესი 
#მნიშვნელობის ცვლადის გაყოფას უმცირესზე, საბოლოოდ type ინსტრუქციის გამოყენებით შეამოწმეთ მე-3 ცვლადის მონაცემის ტიპი.