#2) მომხმარებელს შემოატანინეთ სიტყვა, შემდეგ slicing-ის დახმარებით if-ით შეამოწმეთ ეს სიტყვა თუ იგივე როდესაც შემოაბრუნებთ თუ იგივეა დაბეჭდეთ 
#რომ განსაკუთრებული (ასეთ სიტყვებს palindrome ჰქვია) სიტყვაა, სხვა შემთხვევაში კი დაბეჭდეთ რომ ჩვეულებრივი სიტყვაა.
#3) შექმენით სიტყვების სია, შემდეგ მას გადაუარეთ for ციკლით, დაბეჭდეთ ყოველი ელემენტი ოღონდ ყოველი მეორე (რომ გაიგოთ ყოველი მეორე აიღეთ 
# ცვლადი რომელიც თავიდან 0 იქნება, ყოველ გამეორებაზე კი გაზრდით ერთით და შეამოწმეთ ლუწია თუ კენტი) უნდა იყოს შემობრუნებული
# 4) მომხმარებელს შემოატანინეთ სიტყვა და დაბეჭდეთ ის შებრუნებულად
# 5) შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს 
# string ხუთგვარად შემდეგი პირობებით:

# - მხოლოდ პირველი 5 სიმბოლო  
# - ბოლო 4 სიმბოლო  
# - შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
# - მთელი სტრინგი შებრუნებულად  
# - სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე
