#1) შექმენი სია `fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"]` და დაბეჭდე მესამე ელემენტი
#2) შექმენი სია `numbers = [10, 20, 30, 40, 50]`, შეცვალე მეორე ელემენტი 25-ით და დაბეჭდე განახლებული სია
#3) მომხმარებელს შეაყვანინე ინდექსი (`0`-დან `4`-მდე) და დაბეჭდე შესაბამისი ელემენტი სიიდან `colors = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", 
#"იასამნისფერი"]
#4) შექმენი სია `animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"]`, შეცვალე ბოლო ელემენტი "გემი"-თ და დაბეჭდე სია
#5) მომხმარებელს შეაყვანინე ინდექსი და ახალი ფერი, შეცვალე ამ ინდექსზე არსებული ფერი სიაში `colors = ["თეთრი", "შავი", "ნარინჯისფერი", 
#"ვარდისფერი"]` და დაბეჭდე განახლებული სია