#input და output წარმოადგენენ მონაცემთა შეყვანის და გამოსაცემის პროცესებს, რომლებიც პროგრამირების ძირითად ნაწილებს წარმოადგენს.

#input არის პროცესი, რომლის მეშვეობითაც პროგრამა იღებს მონაცემებს მომხმარებლისგან. ეს შეიძლება იყოს სახელი, ასაკი, ელფოსტის მისამართი, ან 
#ნებისმიერი სხვა ინფორმაცია, რომელიც პროგრამას უნდა ჰქონდეს. Python-ში input() ფუნქცია გამოიყენება მომხმარებლისგან მონაცემების მისაღებად.
name = input("შეიყვანეთ თქვენი სახელი: ")
print(f"გამარჯობა, {name}!")

#output არის მონაცემები, რომლებიც პროგრამა გამოაქვს პროცესის ან დათქმულ მოქმედების შემდეგ. ეს შეიძლება იყოს ტექსტი, რიცხვი, სურათები ან სხვა 
#ფორმატები, რომლებიც ჩანს ეკრანზე. Python-ში print() ფუნქცია გამოიყენება მონაცემების გამოშვებისთვის.
age = 25
print(f"თქვენი ასაკი არის: {age} წლის.")

