#2
word = input("შეიყვანეთ სიტყვა: ")

if word == word[::-1]:
    print("ეს განსაკუთრებული სიტყვაა (პალინდრომია)!")
else:
    print("ეს ჩვეულებრივი სიტყვაა.")

#3
words = ["ვაშლი", "ბანანი", "სტაფილო", "კარტოფილი", "საზამთრო", "მსხალი"]

index = 0

for word in words:
    if index % 2 == 0: 
        print(word[::-1])
    else:
        print(word) 
    index += 1  

#4
word = input("შეიყვანეთ სიტყვა: ")

print("შებრუნებული სიტყვაა:", word[::-1])

#5
text = "ეს არის ძალიან საინტერესო დავალება!"

# - მხოლოდ პირველი 5 სიმბოლო
print("პირველი 5 სიმბოლო:", text[:5])

# - ბოლო 4 სიმბოლო
print("ბოლო 4 სიმბოლო:", text[-4:])

# - შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
print("მეოთხე დან მეათემდე:", text[3:10])

# - მთელი სტრინგი შებრუნებულად
print("შებრუნებული სტრინგი:", text[::-1])

# - სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე
print("ყოველ მეორე სიმბოლო:", text[::2])


