#2) ახსენით რას ნიშნავს რომ list და string არის დალაგებული მიმდევრობები, კომენტარებით დაწერეთ მათ თვისებებს შორის განსხვავებები. მოიყვანეთ 
#მაგალითები
#3) ახსენით რა არის slicing
#4) შექმენით სია რომელშიც ჩამოწერეთ რიცხვებს 1-იდან 20-ის ჩათვლით. slicing-ის საშვალებით გამოიტანეთ რიხცები 5-იდან 10-მდე
#5) შექმენით სია ციური სხეულებზე სიტყვებით და შემდეგ გამოიტანეთ მხოლოდ ის ელემენტები, რომლებიც ლუწ ინდექსებზე დგანან
#6) შექმენით სია 0-დან 15-მდე რიცხვებით. გამოიტანეთ მხოლოდ ის რიცხვები, რომლებიც კენტ ინდექსებზე დგანან
#7) შექმენით string რომელშიც შეინახავთ თქვენს სახელსა და გვარს, შემდეგ ცალ ცალკე გამოიტანეთ ამ სტრინგიდან ჯერ სახელი და შემდეგ გვარი slicing-ის 
#საშვალებით