#1) შექმენით ონლაინ მაღაზია, სადაც გაყიდით კამერებს და მის  აქსესუარებს. მაღაზიაში უნდა იყოს მინიმუმ 4 პროდუქტი. თითოეულ პროდუქტს უნდა 
#ეწეროს დასახელება(title), აღწერა და ფასი, ასევე ღილაკი "Buy". გამოიყენეთ ტექსტის ფორმატირების და სემატიკური თეგები


#Python:
#input დავალებები:
#1)დაწერეთ პროგრამა, რომელიც ითხოვს მომხმარებლის სახელს და ამის შემდეგ ბეჭდავს: "გამარჯობა, სახელი!"
#2)მომხმარებელს შემოატანინეთ მასზე ინფორმაცია და ეს ყველაფერი ერთ print-ში დაბეჭდეთ


#ლოგიკური ოპერაციებზე დავალებები:
#4)and-ის გამოყენებით გააკეთეთ  boolean მაგალითები მაგალითად True and False და ასე შემდეგ კომენტარში ახსენით თუ რატო გამოდის ეგეთი  
#შედეგი როგორიცაა False
#5)იგივე რამ გააკეთეთ ოღონდ უკვე or-ის გამოყენებით მაგალითად True or False და კომენტარში ახსენით თუ რატომ არის საბოლოო პასუხი True და 
#კიდე ბევრი მაგალითი გააკეთეთ კომენტარით ახსენით

#შედარების ოპერატორებზე დავალება:
#6)შეადარეთ რიცხვები ერთმანეთთან გააკეთეთ 5 მაგალით
#7)შემოატანინეთ მოხმარებელს ასაკი და დაბეჭდეთ არის თუ არა მომხმარებლის მიერ შემოტანილი ასაკი 10 ის ტოლი